<template>
  <div class="container pt-4">
    <h3 class="mb-4">Демонстрационный проект</h3>

    <p>
      Поиск библиотек Москвы.
      <br>Отображение результатов поиска с подсветкой искомого слова.
      <br>Детальная информация в отдельном окне.
    </p>

    <h3 class="mb-4">Технологии</h3>

    <h5>Vue 3</h5>
    <p>Роутинг, Ленивая загрузка, Валидация форм (Vuelidate).</p>

    <h5>Pinia</h5>
    <p>Работа с хранилищем данных.</p>

    <h5>Bootstrap 5</h5>
    <p>
      Работа с компонентами из Vue 3.
      <br>Список компонентов: Icons, Layout, Forms, Navbar, Modal, Alerts, Buttons, ...
    </p>

    <h5>SASS</h5>
    <p>Работа с препроцессором SASS.</p>

    <h5>Docker</h5>
    <p>Конфигурация и создание образа.</p>

    <h5>NGINX</h5>
    <p>Конфигурация HTTP сервера.</p>
  </div>
</template>
